/*
1) Створіть об'єкт з інформацією про себе: ім'я, прізвище, кількість копійок в кишені.
2) Додайте властивість "дата народження" (кирилицею) в форматі дд.мм.рррр
3) Додайте властивість age2033, в яку запишіть число, розрахувавши скільки вам буде років у 2033 році.
4) Виведіть циклом властивості про ваш вік у 2010-2020 роках.
    1. в об'єкті створити ключі(роки) і вписати в них значення(вік)
    2. вивести в консоль
5) Переберіть циклом всі властивості та виведіть їх в консоль у вигляді:
    1. name Бобир
    2. fname Олександр
    3. coins 75
    4. дата народження 05.10.1982
*/

let me = {
    firstName: 'Vlad',
    lastName: 'Vertehel',
    capital: 5000,
    "дата народження": {
        day: 5,
        month: 2,
        year: 2005,
    },
    age2033: 28,
    age2010: 5,
    age2011: 6,
    age2012: 7,
    age2013: 8, 
    age2014: 9,
    age2015: 10,
    age2016: 11,
    age2017: 12,
    age2018: 13,
    age2019: 14,
    age2020: 15,
}

const meKeys = Object.entries(me);
const dateOfBirthKeys = Object.entries(me["дата народження"]);
let date = dateOfBirthKeys.flat();

/* В цьому варіанті ми видаляємо числа, А НЕ ТЕКСТ, з масиву. Використовуючи, такий варіант МОЖНА додати "0" 
перед номером дня та номером місяця (Актуально, якщо народився в подібний день (05.02.2005), 
а не наприклад 12.10.2007, коли нулі попереду номера не потрібні). Але, якщо все ж таки людина народилася
в день, до якого ДОПИСУВАТИ "0" НЕ ПОТРІБНО, то це стане великою ПОМИЛКОЮ, бо дату народження видасть не
у форматі 12.10.2007, а у форматі 012.010.2007. Тому варто не дописувати нулі, це не є помилкою, на відміну
від зайвих нулів попереду числа.
↓              ↓              ↓              ↓              ↓              ↓            ↓           ↓*/
// const deletedNumbers = '0' + date.splice(1, 1) + '.0' + date.splice(2, 1) + '.' + date.splice(3, 3);

/* В цьому варіанті ми видаляємо НЕ ЧИСЛА, А ТЕКСТ. Потім записуємо їх через крапку, АЛЕ, 
використовуючи такий варіант рішення, ми НЕ ЗМОЖЕМО ДОДАТИ "0" перед номером дня та номером місяця.
↓              ↓              ↓              ↓              ↓              ↓*/
const deletedTxt = date.splice(0, 1) + date.splice(1, 1) + date.splice(2, 1);
date = date.join('.');

for(let i = 0; i <= meKeys.length - 1; i++){
    if(i === 3){
        console.log(Object.keys(me)[3] + ': ' + date /*тут ми б замість "date" записали "deletedNumbers", це допише нулі перед днем та місяцем*/);
    } else{
        console.log(meKeys[i].join(': '));
    }
}
